# Introduction to pandas

## Wrangling Tabular Data in Python

### DATA 601

**Syed Tauhid Ullah Shah ([syed.tauhidullahshah@ucalgary.ca](mailto:syed.tauhidullahshah@ucalgary.ca))** 

Further Reading:

* **Python for Data Analysis** (third edition), by _Wes McKinney_  ([online link](https://wesmckinney.com/book/)) <br>
The material in this notebook is based on Chapters 5, 6, 7, and 8.
* [pandas official documentation (latest)](https://pandas.pydata.org/docs/index.html)

## Outline

- **[Introduction](#introduction)**


- **[Core functionality](#core)**


- **[Reading CSV data](#reading)**


- **[Data wrangling](#wrangling)**

## <a name="introduction">Introduction</a>

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

Pandas: Python Data Analysis Library<br>
  By convention, `import pandas as pd`.
  

**Designed for tabular or spreadsheet data.**  
Pandas excels at handling structured data, where data is organized in rows and columns similar to a spreadsheet.

**Borrows many idioms from NumPy but supports heterogeneous data.**  
While Pandas builds upon NumPyâ€™s concepts of arrays and vectorized operations, it allows columns of different data types and more complex data manipulations.

**The main data structures are:**

- **Series:** One-dimensional labeled array capable of holding any data type.
- **DataFrame:** Two-dimensional, tabular data structure with labeled axes (rows and columns).

**Lots of optimized functions to work with small to medium datasets efficiently.**  
Pandas provides a rich set of tools to perform data cleaning, transformation, analysis, and visualization, all while being optimized for performance on datasets that fit in memory.

In [1]:
import pandas as pd
import numpy as np



pd.__version__

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

'2.1.4'

### `Series`

A **Series** is a one-dimensional labeled array capable of holding data of any type (integers, strings, floats, Python objects, etc.). It is one of the fundamental data structures in Pandas and serves as the building block for many operations.

- **Index and Data:**
  - Each element in a Series has an associated label, known as the _index_.  
    These labels are used to access and manipulate data within the Series.
  - The index can consist of a range of values, strings, or even dates, and does not need to be unique, although unique indices can improve performance.

- **Behavior and Characteristics:**
  - A Series behaves similarly to a Python `dict`, where the index acts as keys and the stored data as values.  
    Unlike a regular dictionary, however, a Series maintains an order, meaning the sequence of items is preserved.
  - Series support duplicate indices, which means the same label can appear more than once. However, for efficient lookups (e.g., $O(1)$ access time), it is advisable to use unique indices where possible.
  
- **Indexing and Filtering:**
  - Series support NumPy-like indexing and slicing, allowing you to access data using integer positions (`.iloc`) or index labels (`.loc`).

  
- **Vectorized Computation:**
  - Operations on Series are vectorized, meaning computations are applied element-wise without explicit Python loops.  
    This leads to concise, readable code and significant performance benefits.
  - Because Series data is stored internally as a NumPy array, many NumPy functions and operations can be applied directly to Series.

In [2]:
# Series example

#Let's create a series from a dictionary. We can assign names to the index and the values.

ages_data = {'susan': 22, 'joe': 29, 'al': 21, 'frank': 30, 'salim': 27}
data = pd.Series(ages_data)
print(data)

susan    22
joe      29
al       21
frank    30
salim    27
dtype: int64

In [3]:

data.index.name = "name"
data.name = "age"
print(data)
print("\n")

name
susan    22
joe      29
al       21
frank    30
salim    27
Name: age, dtype: int64

In [4]:
# The series is iterable.
for i in data:
    print(i)

22
29
21
30
27

In [5]:
# The ordering can be changed in place
data.sort_index(inplace=True) # The inplace=True argument ensures that the sorting operation modifies the original Series directly, without requiring a reassignment.

print("\n")
print(data)

name
al       21
frank    30
joe      29
salim    27
susan    22
Name: age, dtype: int64

In [6]:
data.sort_values(inplace=True)
print("\n")
print(data)
# inspect the types of the indices and values
print("\n")
print(type(data.index))
print(type(data.values))

name
al       21
susan    22
salim    27
joe      29
frank    30
Name: age, dtype: int64


<class 'pandas.core.indexes.base.Index'>
<class 'numpy.ndarray'>

In [7]:
# We can alter the index and the values in-place
data.index = [str.upper(name) for name in data.index]
print(data)
print("\n")

AL       21
SUSAN    22
SALIM    27
JOE      29
FRANK    30
Name: age, dtype: int64

In [8]:

data["AL"] = data["AL"] + 5
print(data)

AL       26
SUSAN    22
SALIM    27
JOE      29
FRANK    30
Name: age, dtype: int64

In [9]:
# add some more data
data["BOB"] = 28
data["BOB"] = 29
data["JOHN"] = pd.NA # sometimes used to represent missing data
                      # Leads to type up-conversion since np.nan is a float
print("\n")
print(data)

AL       26.0
SUSAN    22.0
SALIM    27.0
JOE      29.0
FRANK    30.0
BOB      29.0
JOHN      NaN
Name: age, dtype: float64

In [10]:
# Let's investigate the impact of non-unique indices.

x = np.random.randint(0, high=10**6, size=10**6)
s1 = pd.Series(x) # this will have default integer indices.

print(s1)

0         740844
1          35628
2         105734
3         907695
4         873187
           ...
999995    925073
999996     19449
999997    220973
999998    836606
999999    415790
Length: 1000000, dtype: int64

In [11]:
s1.index.name="unique"
s1.name="rands"
print(s1.is_unique)

print("\n")

False

In [12]:

s2 = s1.reindex(index=x) # to align, reorder, or expand data to match a specified index structure.
s2.index.name="not-unique"
print(s2.head())
print("\n")

not-unique
740844    790979
35628     174272
105734    460343
907695    434703
873187    337587
Name: rands, dtype: int64

In [13]:

s3 = s2.sort_index()
s3.index.name="not-unique-sorted"
print(s3.head())
print("\n")

not-unique-sorted
2    105734
2    105734
4    873187
5    667921
6    163531
Name: rands, dtype: int64

In [14]:
s2.index[0]

740844

In [15]:
%time print(s1[s2.index[0]])
print("\n")

%time print(s2[s2.index[0]])
print("\n")

%time print(s3[s2.index[0]])

790979
CPU times: user 69 Î¼s, sys: 5 Î¼s, total: 74 Î¼s
Wall time: 74.4 Î¼s


790979
CPU times: user 29.7 ms, sys: 4.4 ms, total: 34.1 ms
Wall time: 32 ms


790979
CPU times: user 25.6 ms, sys: 4.71 ms, total: 30.3 ms
Wall time: 30.3 ms

### How to retrieving elements based on labels?
.loc (Label-Based Indexing)
Definition: Accesses elements in a Series by their labels (from the index).

In [16]:
# Create a Series with labeled indices
data = pd.Series([10, 20, 30, 40], index=["a", "b", "c", "d"])
print(data)

a    10
b    20
c    30
d    40
dtype: int64

In [17]:
# Access a single element
print(data.loc["a"])  # Output: 10
# Access Multiple Elements
print(data.loc[["a", "c"]])
# Access a Slice
print(data.loc["a":"c"])  # Slicing includes the endpoint

10
a    10
c    30
dtype: int64
a    10
b    20
c    30
dtype: int64

.iloc (Integer-Based Indexing)
Definition: Accesses elements in a Series by their integer position (similar to NumPy arrays).

In [18]:
# Access a Single Element by Position:
print(data.iloc[0])  # Output: 10

# Access Multiple Elements by Positions:
print(data.iloc[[0, 2]])

10
a    10
c    30
dtype: int64

In [19]:
# Access a Slice
print(data.iloc[0:3])  # Slicing excludes the endpoint

a    10
b    20
c    30
dtype: int64

### `DataFrame`

A **DataFrame** is the primary data structure in Pandas for working with tabular data. It represents a rectangular 2D table with labeled axesâ€”rows and columnsâ€”and is designed to handle heterogeneous data types efficiently.

#### Key Characteristics

- **Two-Dimensional Structure**:  
  A DataFrame organizes data into rows and columns, similar to a spreadsheet, SQL table, or an Excel worksheet.

- **Heterogeneous Columns**:  
  Each column in a DataFrame can be of a different data type (e.g., integers, floats, strings, booleans), enabling complex and varied datasets to be represented within a single structure.

- **Underlying Series Objects**:  
  Think of a DataFrame as a collection of multiple `Series` objects that share the same index. Each column is essentially a Series. This means that many operations applied to a DataFrame operate column-wise, leveraging Series functionality.

- **Indexing Capabilities**:  
  Both rows and columns are labeled, meaning you can access data by row labels, column labels, or both. This flexibility allows for powerful and precise data selection, slicing, sorting, and filtering operations.

- **Data Manipulation and Transformation**:  
  DataFrames support a wide range of operations including:
  - Sorting by row or column indices or by values.
  - Filtering rows based on conditions (boolean indexing).
  - Adding, modifying, or deleting rows and columns.
  - Aggregating and summarizing data through grouping and pivoting.

- **Input/Output Convenience**:  
  Pandas provides a wealth of functions to read data from and write data to various formats (CSV, Excel, JSON, SQL databases, etc.). These functions return a DataFrame, making it easy to begin working with the data immediately.

In [20]:
ages_data

{'susan': 22, 'joe': 29, 'al': 21, 'frank': 30, 'salim': 27}

In [21]:
ages_data.keys()

dict_keys(['susan', 'joe', 'al', 'frank', 'salim'])

In [22]:
# Let's build a data frame by adding another column to the series 

loc_data = dict(zip(ages_data.keys(),['Calgary', 'Calgary', 'Vancouver', 'Toronto', 'Beirut']))

loc_data

{'susan': 'Calgary',
 'joe': 'Calgary',
 'al': 'Vancouver',
 'frank': 'Toronto',
 'salim': 'Beirut'}

In [23]:
frame_data = {'age': [*ages_data.values()], 'location': [*loc_data.values()] }
frame_data

{'age': [22, 29, 21, 30, 27],
 'location': ['Calgary', 'Calgary', 'Vancouver', 'Toronto', 'Beirut']}

In [24]:
frame = pd.DataFrame(frame_data)
frame

   age   location
0   22    Calgary
1   29    Calgary
2   21  Vancouver
3   30    Toronto
4   27     Beirut

In [25]:
frame.index = [*ages_data.keys()]
frame.index.name = "Name"
display(frame)

       age   location
Name
susan   22    Calgary
joe     29    Calgary
al      21  Vancouver
frank   30    Toronto
salim   27     Beirut

In [26]:
# We can index by column in one of two ways. A series is returned
print(frame["age"]) # syntax for columns
print("\n")
print(frame.age)
print("\n")

print(frame["location"])
print("\n")

Name
susan    22
joe      29
al       21
frank    30
salim    27
Name: age, dtype: int64


Name
susan    22
joe      29
al       21
frank    30
salim    27
Name: age, dtype: int64


Name
susan      Calgary
joe        Calgary
al       Vancouver
frank      Toronto
salim       Beirut
Name: location, dtype: object

In [27]:
# individual entries can be altered. Preferred way to do that is to use the 
# loc operator (with numpy like syntax). pandas manual advises against 
# using chained indexing.

print(frame.loc["susan"]) # syntax for rows
print("\n")
print(frame.loc["susan", "age"])

age              22
location    Calgary
Name: susan, dtype: object


22

In [28]:
'''Why It's Problematic:

This is known as chained indexing because it uses two separate indexing operations. 
It is not recommended in Pandas for the following reasons:
Ambiguity: Itâ€™s unclear if you're trying to access a value or modify it.
Performance: Chained indexing can be slower because Pandas performs the indexing in two separate steps rather 
than in a single optimized operation.
Unintended Behavior: Changes made with chained indexing might not propagate properly to the original DataFrame.
'''
# chained index - don't use this!
print(frame["age"]["susan"]) 

# A better solution

frame.loc["susan", "age"] = 24

frame

22

       age   location
Name
susan   24    Calgary
joe     29    Calgary
al      21  Vancouver
frank   30    Toronto
salim   27     Beirut

## <a name="core">Core Functionality</a>

- Many fundamental operations on tabular data are already implemented with convenient syntactic sugar. Do not reinvent the wheel, try and make use of vectorized computation as much as possible.


- Some things we may want to do with tabular data:

  - Indexing, selection and filtering
  
  - Sorting

  - Arithmetic, function application, computing statistics

In [29]:
# Indexing and slicing using the indexing operator []:
# Indexing using the '[]' operator indexes the columns.

print(frame['age']) # one column
display(frame[['location','age']]) # or a list of columns

Name
susan    24
joe      29
al       21
frank    30
salim    27
Name: age, dtype: int64

        location  age
Name
susan    Calgary   24
joe      Calgary   29
al     Vancouver   21
frank    Toronto   30
salim     Beirut   27

In [30]:
# Can also use [] operator with the slicing operator : to index rows
print("\n")
display(frame[0:2])
print("\n")
display(frame['al':])

       age location
Name
susan   24  Calgary
joe     29  Calgary

       age   location
Name
al      21  Vancouver
frank   30    Toronto
salim   27     Beirut

In [31]:
# Some may prefer indexing and slicing using loc (label indexing) and 
# iloc(integer indexing)

# Lets add another column of data first
frame['ID'] = pd.Series(np.random.randint(low=100, high=1000, size=len(frame.index)), index=frame.index)
display(frame)

       age   location   ID
Name
susan   24    Calgary  830
joe     29    Calgary  185
al      21  Vancouver  168
frank   30    Toronto  694
salim   27     Beirut  337

In [32]:

# loc indexing and slicing behave like numpy, the first argument is the
# row, the second is the column
print(frame.loc['susan',:])
display(frame.loc['susan',['ID','age']])
display(frame.loc['susan':'al',['ID','age']])
display(frame.loc['susan':'al', 'age':'location'])

frame.loc['susan':'al','ID'] = 0 
frame

age              24
location    Calgary
ID              830
Name: susan, dtype: object

ID     830
age     24
Name: susan, dtype: object

        ID  age
Name
susan  830   24
joe    185   29
al     168   21

       age   location
Name
susan   24    Calgary
joe     29    Calgary
al      21  Vancouver

       age   location   ID
Name
susan   24    Calgary    0
joe     29    Calgary    0
al      21  Vancouver    0
frank   30    Toronto  694
salim   27     Beirut  337

In [33]:
# Boolean indexing and filtering
#
# AKA: How to execute SQL-like queries
#
# Selecting and filtering data in pandas is done through boolean
# indexing. The syntax is similar to numpy. 
display(frame)

# select all rows where age >= 25
display(frame[frame["age"] >= 25])
#display(frame[frame["age"] >= 25])

# select all rows where location is Calgary
#display(frame[frame["location"] == 'Calgary'])

# Some may find the following syntax more convenient
#display(frame[(frame.age <=27) & (frame.ID > 0)])

       age   location   ID
Name
susan   24    Calgary    0
joe     29    Calgary    0
al      21  Vancouver    0
frank   30    Toronto  694
salim   27     Beirut  337

       age location   ID
Name
joe     29  Calgary    0
frank   30  Toronto  694
salim   27   Beirut  337

In [34]:
#display(frame.loc[(frame.age <=27) & (frame.ID > 0)])
mask = (frame.age <=27) & (frame.ID > 0)
display(frame[mask])

       age location   ID
Name
salim   27   Beirut  337

In [35]:
# Organising query results

display(frame)

# Display only a subset of the columns
display(frame.loc[frame.age >= 25].loc[:,["age", "location"]])

# Sorting the index in reverse order
display( frame.loc[frame.age >= 25].loc[:,["age", "location"]].sort_index(ascending=False) )

# sorting according to a particular column
display(frame.loc[frame.age >= 25].loc[:,["age", "location"]].sort_values(by='location', ascending=False))

       age   location   ID
Name
susan   24    Calgary    0
joe     29    Calgary    0
al      21  Vancouver    0
frank   30    Toronto  694
salim   27     Beirut  337

       age location
Name
joe     29  Calgary
frank   30  Toronto
salim   27   Beirut

       age location
Name
salim   27   Beirut
joe     29  Calgary
frank   30  Toronto

       age location
Name
frank   30  Toronto
joe     29  Calgary
salim   27   Beirut

### Arithmetic Operations and Function Application

- Since series data is stored as NumPy arrays, vectorized arithmetic operations between DataFrames are supported.


- Similarly, we can apply functions to entire rows or columns in a vectorized manner.


- DO NOT loop over the data, this is inefficient!


- By default, a binary arithmetic operation on two dataframes will align by the row and column indices, performing a union of the indices. Missing values are created for data that does not exist.

In [36]:
# Let's create two dataframes and add them together

f1 = pd.DataFrame(np.arange(12).reshape((4,3)), columns=list('ABC'), index=['susan', 'joe', 'frank', 'al'])
f2 = pd.DataFrame(np.arange(9).reshape((3,3)), columns=list('BCD'), index=['susan', 'joe', 'robert'])
display(f1)
display(f2)

display(f1 + f2)

       A   B   C
susan  0   1   2
joe    3   4   5
frank  6   7   8
al     9  10  11

        B  C  D
susan   0  1  2
joe     3  4  5
robert  6  7  8

         A    B    C   D
al     NaN  NaN  NaN NaN
frank  NaN  NaN  NaN NaN
joe    NaN  7.0  9.0 NaN
robert NaN  NaN  NaN NaN
susan  NaN  1.0  3.0 NaN

In [37]:
# Arithmetic operations are also defined between a dataframe and a series. The series
# is "broadcast" to all the rows of the dataframe. 

display(f1)
display(f2)
display(f1.loc["susan"] + f1)
display(f2.loc["susan"] + f1)

       A   B   C
susan  0   1   2
joe    3   4   5
frank  6   7   8
al     9  10  11

        B  C  D
susan   0  1  2
joe     3  4  5
robert  6  7  8

       A   B   C
susan  0   2   4
joe    3   5   7
frank  6   8  10
al     9  11  13

        A     B     C   D
susan NaN   1.0   3.0 NaN
joe   NaN   4.0   6.0 NaN
frank NaN   7.0   9.0 NaN
al    NaN  10.0  12.0 NaN

In [38]:
# Vectorized functions for simple aggregation

display(f1)
display(f1.sum()) # Sum down the columns
print("\n")

       A   B   C
susan  0   1   2
joe    3   4   5
frank  6   7   8
al     9  10  11

A    18
B    22
C    26
dtype: int64

In [39]:
display(f1.sum(axis='columns') ) # Sum along the rows

susan     3
joe      12
frank    21
al       30
dtype: int64

In [40]:
display(f1)
# Can also do accumulations
display(f1.cumsum())

# NumPy ufuncs are also supported.
display(np.cos(f1))  # Applies to the entire array. Numeric data needed.
display(np.cos(f1.loc["susan"])) # applies to the specific row

       A   B   C
susan  0   1   2
joe    3   4   5
frank  6   7   8
al     9  10  11

        A   B   C
susan   0   1   2
joe     3   5   7
frank   9  12  15
al     18  22  26

              A         B         C
susan  1.000000  0.540302 -0.416147
joe   -0.989992 -0.653644  0.283662
frank  0.960170  0.753902 -0.145500
al    -0.911130 -0.839072  0.004426

A    1.000000
B    0.540302
C   -0.416147
Name: susan, dtype: float64

In [41]:
# Apply and Map for Data Transformation
# Use apply to apply custom functions to the rows or columns
# In the following, the argument is the entire row (or column)
display(f1)

func = lambda x: np.sqrt(np.dot(x, x))

display(f1.apply(func))
print("\n")

       A   B   C
susan  0   1   2
joe    3   4   5
frank  6   7   8
al     9  10  11

A    11.224972
B    12.884099
C    14.628739
dtype: float64

In [42]:
display(f1.apply(func, axis="columns"))
print("\n")

susan     2.236068
joe       7.071068
frank    12.206556
al       17.378147
dtype: float64

In [43]:

# Use map to apply a function in an element-wise manner
formatter = lambda x: '%0.2f' % x

display(f1.apply(func, axis="columns").map(formatter))
print("\n")
display(f1.map(lambda x: x*x))

susan     2.24
joe       7.07
frank    12.21
al       17.38
dtype: object

        A    B    C
susan   0    1    4
joe     9   16   25
frank  36   49   64
al     81  100  121

## <a name="reading">Importing Data into pandas</a>

- Pandas provides a number of readers and writers to read/write data in various tabular formats.


- For a reader, the input can be in text format (csv, html etc.) or a binary format (e.g. HDF5) and the output is a `DataFrame` object. Portions of a dataset can also be read.


- Readers have numerous options to specify how the data is delimited, how it is to be interpreted (data types for columns), what to do with missing values etc.


- Here, we'll look at some examples of reading csv files. Please refer to `pandas` [documentation](http://pandas.pydata.org/pandas-docs/stable/io.html) for additional supported file formats.

In [47]:

# Base URL for raw content in the 3rd-edition branch
URL_base = "https://raw.githubusercontent.com/wesm/pydata-book/3rd-edition/"

# File paths
ex1 = "examples/ex1.csv"
ex2 = "examples/ex2.csv"

# Construct full URLs
url_ex1 = URL_base + ex1
url_ex2 = URL_base + ex2

# Reading the first CSV file
df_ex1 = pd.read_csv(url_ex1)
display(df_ex1)

# Reading the second CSV file without headers
df_ex2_no_header = pd.read_csv(url_ex2, header=None)
display(df_ex2_no_header)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [48]:

# Specifying column names
names = ['A', 'B', 'C', 'D', 'message']
df_ex2_with_names = pd.read_csv(url_ex2, names=names)
display(df_ex2_with_names)

# Setting one of the columns as the index
df_ex2_indexed = pd.read_csv(url_ex2, names=names, index_col='A')
display(df_ex2_indexed)

   A   B   C   D message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

    B   C   D message
A
1   2   3   4   hello
5   6   7   8   world
9  10  11  12     foo

In [19]:
# The delimiter can be specified, we can use regular expressions.

ex3 = "examples/ex3.txt"

# whitespace as a separator
display(pd.read_csv(URL_base + ex3, sep='\s+'))

# Specifying missing values
ex5 = 'examples/ex5.csv'
display(pd.read_csv(URL_base + ex5))
miss = {'message': ['NA', 'foo'], 'something': ['two']}
display(pd.read_csv(URL_base + ex5, na_values=miss))

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Exercise

- Read the [Historical Rainfall](https://data.calgary.ca/Environment/Historical-Rainfall/d9kv-swk3) dataset from the [City of Calgary's Open Data Portal](https://data.calgary.ca).
- Display the head and tail of the dataset.
- Get a list of all the communities where the rain gauges are located.
- Plot a histogram of the values in the 'rainfall' column to get a sense of the distribution of data in this column.

In [50]:
# When working with large files or to get an idea of the structure of the data,
# it may be useful to read the data in pieces.

ex6 = 'examples/ex6.csv'
frame = pd.read_csv(URL_base + ex6, nrows=10)
display(frame)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [52]:
# We can specify a chunksize (in terms of number of rows) 
# and read the file incrementally

streamer = pd.read_csv(URL_base + ex6, chunksize=1000)
print(type(streamer))

# Now we can iterate over the chunks
totalone = 0
for chunk in streamer:
    totalone += chunk['one'].sum()
    
print(totalone)

<class 'pandas.io.parsers.readers.TextFileReader'>
457.5016080420038

### Exercise

- For the above example dataset, read in chunks of 100 rows and determine the mean values for the first four columns.


- Use the `DataFrame` member function `sum()` to determine the sum of each column in each chunk.
  - Beware of _overflow_ issues when summing up large arrays. For this exercise, you don't need to worry about it.


- Verify your answer by computing the mean directly (i.e. by reading the dataset in full).